### Groupby

In [6]:
import pandas as pd

data = {'Classe':['Junior', 'Junior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
        'Nome':['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
        'Venda':[200, 120, 340, 124, 243, 350]}

In [7]:
df = pd.DataFrame(data)
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [12]:
group = df.groupby("Classe")
#agrupar direto = df.groupby("Classe").sum()

In [10]:
group.sum()

        Venda
Classe
Junior    320
Pleno     464
Sênior    593

In [13]:
group.mean()

        Venda
Classe
Junior  160.0
Pleno   232.0
Sênior  296.5

In [14]:
group.max()

           Nome  Venda
Classe
Junior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350